tests/fixtures/stripe/subscription.cancel.success.json

{
  "id": "sub_EqbodmvaXCxGtb",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1554718853,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": 1554993162,
  "created": 1554718853,
  "current_period_end": 1557310853,
  "current_period_start": 1554718853,
  "customer": "cus_ErnYW2Pdf9f2up",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_Eqbo4j0ySlHTPz",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1554718854,
        "metadata": {},
        "plan": {
          "id": "gold-corporate-622",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 999,
          "billing_scheme": "per_unit",
          "created": 1554718819,
          "currency": "eur",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "product": "prod_EqbnZkPgzEkzOf",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_EqbodmvaXCxGtb"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_EqbodmvaXCxGtb"
  },
  "latest_invoice": "in_1EMuavADEVbkzKpD7Y9LniwS",
  "livemode": false,
  "metadata": {},
  "plan": {
    "id": "gold-corporate-622",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 999,
    "billing_scheme": "per_unit",
    "created": 1554718819,
    "currency": "eur",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": null,
    "product": "prod_EqbnZkPgzEkzOf",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1554718853,
  "status": "canceled",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}